#pragma once

//============================================================================
//	include
//============================================================================
#include <Engine/Editor/UI/Tools/UIToolContext.h>

namespace SakuEngine {

	//============================================================================
	//	IUIToolPanel class
	//	UIツールパネルのインターフェース
	//============================================================================
	class IUIToolPanel {
	public:
		//========================================================================
		//	public Methods
		//========================================================================

		IUIToolPanel() = default;
		virtual ~IUIToolPanel() = default;

		// エディター
		virtual void ImGui(UIToolContext& context) = 0;

		//--------- accessor -----------------------------------------------------

		// エディタの名前、パネルに表示する
		virtual const char* GetName() const = 0;
	};
} // SakuEngine