#pragma once

//============================================================================
//	include
//============================================================================
#include <Engine/Editor/UI/System/Interface/IUISystem.h>

// c++
#include <vector>

namespace SakuEngine {

	//============================================================================
	//	UIRuntime class
	//	UIアセットをランタイム更新するクラス
	//============================================================================
	class UIRuntime {
	public:
		//========================================================================
		//	public Methods
		//========================================================================

		UIRuntime() = default;
		~UIRuntime() = default;

		// 初期化
		void Init();

		// UIアセットを更新
		void Update(UIAsset& asset);
	private:
		//========================================================================
		//	private Methods
		//========================================================================

		//--------- variables ----------------------------------------------------

		// アセット更新を行うシステム群
		std::vector<std::unique_ptr<IUISystem>> systems_;
	};
} // SakuEngine