#pragma once

//============================================================================
//	include
//============================================================================

// c++
#include <cstdint>

namespace SakuEngine {

	//============================================================================
	//	IUIComponent structures
	//============================================================================

	// UIコンポーネントの種類
	enum class UIComponentType :
		uint32_t {

		ParentRectTransform,
		SpriteTransform,
		TextTransform,
		Sprite,
		Text,
	};

	//============================================================================
	//	IUIComponent class
	//	UIコンポーネントのインターフェース
	//============================================================================
	class IUIComponent {
	public:
		//========================================================================
		//	public Methods
		//========================================================================

		IUIComponent() = default;
		virtual ~IUIComponent() = default;

		//--------- accessor -----------------------------------------------------

		// コンポーネントの種類を取得
		virtual UIComponentType GetType() const = 0;
	};
} // SakuEngine