#pragma once

//============================================================================
//	include
//============================================================================

// directX
#include <d3d12.h>
// imgui
#include <imgui.h>

namespace SakuEngine {

	//============================================================================
	//	UIWidgetVisualDesigner class
	//	UIウィジェットの現在の見た目を確認、編集するためのクラス
	//============================================================================
	class UIWidgetVisualDesigner {
	public:
		//========================================================================
		//	public Methods
		//========================================================================

		UIWidgetVisualDesigner() = default;
		~UIWidgetVisualDesigner() = default;

		// 初期化
		void Init(const D3D12_GPU_DESCRIPTOR_HANDLE& renderTextureGPUHandle);

		// エディター
		void ImGui();

		//--------- accessor -----------------------------------------------------

	private:
		//========================================================================
		//	private Methods
		//========================================================================

		//--------- variables ----------------------------------------------------

		// 描画用テクスチャのGPUハンドル
		D3D12_GPU_DESCRIPTOR_HANDLE renderTextureGPUHandle_{};

		// エディタデバッグ
		ImVec2 gameViewSize_ = ImVec2(896.0f, 504.0f);

		//--------- functions ----------------------------------------------------

	};
} // SakuEngine