#pragma once

//============================================================================
//	include
//============================================================================

// c++
#include <cstdint>

//============================================================================
//	PlayerInputAction enum class
//============================================================================

enum class PlayerInputAction :
	uint8_t {

	MoveX,   // X移動
	MoveZ,   // Z移動
	Dash,    // ダッシュ
	Avoid,   // 回避
	Attack,  // 通常攻撃
	Skill,   // スキル攻撃
	Switching,    // 切り替える
	NotSwitching, // 切り替えない
	Parry,        // パリィ
	Count,   // アクションの数
};