#pragma once

//============================================================================
//	include
//============================================================================
#include <Engine/Editor/UI/AssetData/UIAsset.h>

namespace SakuEngine {

	//============================================================================
	//	IUISystem class
	//	UIを処理するシステムのインターフェース
	//============================================================================
	class IUISystem {
	public:
		//========================================================================
		//	public Methods
		//========================================================================

		IUISystem() = default;
		virtual ~IUISystem() = default;

		// UIアセットを更新
		virtual void Update(UIAsset& asset) = 0;
	};
} // SakuEngine