#include "UIWidgetPalette.h"

using namespace SakuEngine;

//============================================================================
//	include
//============================================================================

// imgui
#include <imgui.h>

// 進捗バー
// 放射状進捗バー
// スライダー
// チェックボックス
// テキストボックス
// ボタン
// 画像

//============================================================================
//	UIWidgetPalette classMethods
//============================================================================

void UIWidgetPalette::ImGui() {

	ImGui::Begin("Palette##UIWidgetPalette");

	ImGui::End();
}