#pragma once

//============================================================================
//	include
//============================================================================
#include <Game/Scene/GameState/Interface/IGameSceneState.h>

//============================================================================
//	EndGameState class
//	敵、プレイヤーのどちらかが倒された後の状態
//============================================================================
class EndGameState :
	public IGameSceneState {
public:
	//========================================================================
	//	public Methods
	//========================================================================

	EndGameState(GameContext* context) :IGameSceneState(context) {}
	~EndGameState() = default;

	void Init(SakuEngine::SceneView* sceneView) override;

	void Update() override;
	void NonActiveUpdate() override;
private:
	//========================================================================
	//	private Methods
	//========================================================================

	//--------- variables ----------------------------------------------------



	//--------- functions ----------------------------------------------------

};