#include "UIAnimationPanel.h"

using namespace SakuEngine;

//============================================================================
//	include
//============================================================================
#include <Engine/Editor/UI/Animation/UIAnimationLibrary.h>

//============================================================================
//	UIAnimationPanel classMethods
//============================================================================

void UIAnimationPanel::ImGui(UIToolContext& context) {

	context;

	// 機能:
	// アニメーション追加、一覧表示(ここからドラッグアンドドロップ)、選択、削除
	// 選択中アニメーションの編集、保存、読み込み(読みこんだら読み込んだアニメーションデータで完全に上書きする)
	// 選択中アニメーションのプレビュー再生、プレビューの有無の設定
}