#pragma once

//============================================================================
//	include
//============================================================================
#include <Engine/Editor/UI/Tools/Interface/IUIToolPanel.h>

namespace SakuEngine {

	//============================================================================
	//	UIHierarchyPanel class
	//	UIの階層構造を表示、編集するパネル
	//============================================================================
	class UIHierarchyPanel :
		public IUIToolPanel {
	public:
		//========================================================================
		//	public Methods
		//========================================================================

		UIHierarchyPanel() = default;
		~UIHierarchyPanel() = default;

		// エディター
		void ImGui(UIToolContext& context) override;

		//--------- accessor -----------------------------------------------------

		// エディタの名前、パネルに表示する
		const char* GetName() const override { return "Hierarchy##UIEditor"; }
	private:
		//========================================================================
		//	private Methods
		//========================================================================

		//--------- variables ----------------------------------------------------



		//--------- functions ----------------------------------------------------

	};
} // SakuEngine