#pragma once

//============================================================================
//	include
//============================================================================

namespace SakuEngine {

	// front
	class UIAnimationLibrary;

	//============================================================================
	//	UISystemContext class
	//	UIシステムのコンテキスト情報を管理するクラス
	//============================================================================
	struct UISystemContext {
	public:
		//========================================================================
		//	public Methods
		//========================================================================

		UISystemContext() = default;
		~UISystemContext() = default;

		//--------- variables ----------------------------------------------------

		// UIアニメーションライブラリ
		UIAnimationLibrary* animationLibrary = nullptr;
	};
} // SakuEngine