#pragma once

//============================================================================
//	include
//============================================================================

// c++
#include <string>

namespace SakuEngine {

	//============================================================================
	//	ITextGenerator class
	//	MSDFText に表示する UTF-8 文字列を生成するインターフェース
	//============================================================================
	class ITextGenerator {
	public:
		//========================================================================
		//	public Methods
		//========================================================================

		ITextGenerator() = default;
		virtual ~ITextGenerator() = default;

		// 文字列生成、変更があればtrueを返す
		virtual bool Generate(std::string& outString) = 0;
	};
} // SakuEngine